1 : Job ID 8f1322ed8e7e4d1797287cbbddc4ff05
test outcome: killed
app\operacoes_financeiras.py, start pos: (24, 22), end pos: (24, 23)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 0
--- mutation diff ---
--- aapp\operacoes_financeiras.py
+++ bapp\operacoes_financeiras.py
@@ -21,7 +21,7 @@
 def sacar(contas, client_id, valor):
     conta = pegar_conta(contas, client_id)
-    if conta["saldo"] < valor:
+    if conta["saldo"] == valor:
         raise Exception("Saldo insuficiente")
     conta["saldo"] -= valor
     registrar_historico(conta, {
============================= test session starts =============================
tests\test_operacoes_financeiras.py .F.                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
================================== FAILURES ===================================
____________________________ TestContas.test_sacar ____________________________
self = <test_operacoes_financeiras.TestContas testMethod=test_sacar>
    def test_sacar(self):
        with self.assertRaises(Exception):
>           sacar(self.contas, "client_id_123", 1100)
E           AssertionError: Exception not raised
tests\test_operacoes_financeiras.py:26: AssertionError
=========================== short test summary info ===========================
FAILED tests/test_operacoes_financeiras.py::TestContas::test_sacar - Assertio...
========================= 1 failed, 4 passed in 0.12s ===============

2 : Job ID dbccbeb1d93c491ca8c617175e17e4eb
test outcome: killed
app\operacoes_financeiras.py, start pos: (35, 29), end pos: (35, 30)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 1
--- mutation diff ---
--- aapp\operacoes_financeiras.py
+++ bapp\operacoes_financeiras.py
@@ -32,7 +32,7 @@
 def transferir(contas, client_id_origem, client_id_destino, valor):
     conta_origem = pegar_conta(contas, client_id_origem)
     conta_destino = pegar_conta(contas, client_id_destino)
-    if conta_origem["saldo"] < valor:
+    if conta_origem["saldo"] == valor:
         raise Exception("Saldo insuficiente")
     conta_origem["saldo"] -= valor
     conta_destino["saldo"] += valor
============================= test session starts =============================
tests\test_operacoes_financeiras.py ..F                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
================================== FAILURES ===================================
_________________________ TestContas.test_transferir __________________________
self = <test_operacoes_financeiras.TestContas testMethod=test_transferir>
    def test_transferir(self):
        with self.assertRaises(Exception):
>           transferir(self.contas, "client_id_123", "client_id_abc", 1100)
E           AssertionError: Exception not raised
tests\test_operacoes_financeiras.py:35: AssertionError
=========================== short test summary info ===================

3 : Job ID 84b9852870354c10970bd662d2a8131f
test outcome: killed
app\operacoes_financeiras.py, start pos: (24, 22), end pos: (24, 23)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 0
--- mutation diff ---
--- aapp\operacoes_financeiras.py
+++ bapp\operacoes_financeiras.py
@@ -21,7 +21,7 @@
 def sacar(contas, client_id, valor):
     conta = pegar_conta(contas, client_id)
-    if conta["saldo"] < valor:
+    if conta["saldo"] != valor:
         raise Exception("Saldo insuficiente")
     conta["saldo"] -= valor
     registrar_historico(conta, {
============================= test session starts =============================
tests\test_operacoes_financeiras.py .F.                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
================================== FAILURES ===================================
____________________________ TestContas.test_sacar ____________________________
self = <test_operacoes_financeiras.TestContas testMethod=test_sacar>
    def test_sacar(self):
        with self.assertRaises(Exception):
            sacar(self.contas, "client_id_123", 1100)
>       sacar(self.contas, "client_id_123", 100)
tests\test_operacoes_financeiras.py:27: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
contas = {'client_id_123': {'historico': [], 'saldo': 1000}, 'client_id_abc': {'historico': [], 'saldo': 500}}
client_id = 'client_id_123', valor = 100
    def

4 : Job ID fcba0ca424594a7094a942c596a9824e
test outcome: killed
app\operacoes_financeiras.py, start pos: (35, 29), end pos: (35, 30)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 1
--- mutation diff ---
--- aapp\operacoes_financeiras.py
+++ bapp\operacoes_financeiras.py
@@ -32,7 +32,7 @@
 def transferir(contas, client_id_origem, client_id_destino, valor):
     conta_origem = pegar_conta(contas, client_id_origem)
     conta_destino = pegar_conta(contas, client_id_destino)
-    if conta_origem["saldo"] < valor:
+    if conta_origem["saldo"] != valor:
         raise Exception("Saldo insuficiente")
     conta_origem["saldo"] -= valor
     conta_destino["saldo"] += valor
============================= test session starts =============================
tests\test_operacoes_financeiras.py ..F                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
================================== FAILURES ===================================
_________________________ TestContas.test_transferir __________________________
self = <test_operacoes_financeiras.TestContas testMethod=test_transferir>
    def test_transferir(self):
        with self.assertRaises(Exception):
            transferir(self.contas, "client_id_123", "client_id_abc", 1100)
>       transferir(self.contas, "client_id_123", "client_id_abc", 100)
tests\test_operacoes_financeiras.py:36: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

5 : Job ID 616c7c21b83c48ba98c4ae04f14ae03a
SURVIVED
test outcome: survived
app\operacoes_financeiras.py, start pos: (24, 22), end pos: (24, 23)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 0
--- mutation diff ---
--- aapp\operacoes_financeiras.py
+++ bapp\operacoes_financeiras.py
@@ -21,7 +21,7 @@
 def sacar(contas, client_id, valor):
     conta = pegar_conta(contas, client_id)
-    if conta["saldo"] < valor:
+    if conta["saldo"] <= valor:
         raise Exception("Saldo insuficiente")
     conta["saldo"] -= valor
     registrar_historico(conta, {
============================= test session starts =============================
tests\test_operacoes_financeiras.py ...                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
============================== 5 passed in 0.04s ==============================

6 : Job ID a5167cff97a24091b06a8d567e7483e1
SURVIVED
test outcome: survived
app\operacoes_financeiras.py, start pos: (35, 29), end pos: (35, 30)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 1
--- mutation diff ---
--- aapp\operacoes_financeiras.py
+++ bapp\operacoes_financeiras.py
@@ -32,7 +32,7 @@
 def transferir(contas, client_id_origem, client_id_destino, valor):
     conta_origem = pegar_conta(contas, client_id_origem)
     conta_destino = pegar_conta(contas, client_id_destino)
-    if conta_origem["saldo"] < valor:
+    if conta_origem["saldo"] <= valor:
         raise Exception("Saldo insuficiente")
     conta_origem["saldo"] -= valor
     conta_destino["saldo"] += valor
============================= test session starts =============================
tests\test_operacoes_financeiras.py ...                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
============================== 5 passed in 0.05s ==============================

7 : Job ID 4d42fc5347ba438a8c7564365174ead6
test outcome: killed
app\operacoes_financeiras.py, start pos: (24, 22), end pos: (24, 23)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 0
--- mutation diff ---
--- aapp\operacoes_financeiras.py
+++ bapp\operacoes_financeiras.py
@@ -21,7 +21,7 @@
 def sacar(contas, client_id, valor):
     conta = pegar_conta(contas, client_id)
-    if conta["saldo"] < valor:
+    if conta["saldo"] > valor:
         raise Exception("Saldo insuficiente")
     conta["saldo"] -= valor
     registrar_historico(conta, {
============================= test session starts =============================
tests\test_operacoes_financeiras.py .F.                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
================================== FAILURES ===================================
____________________________ TestContas.test_sacar ____________________________
self = <test_operacoes_financeiras.TestContas testMethod=test_sacar>
    def test_sacar(self):
        with self.assertRaises(Exception):
>           sacar(self.contas, "client_id_123", 1100)
E           AssertionError: Exception not raised
tests\test_operacoes_financeiras.py:26: AssertionError
=========================== short test summary info ===========================
FAILED tests/test_operacoes_financeiras.py::TestContas::test_sacar - Assertio...
========================= 1 failed, 4 passed in 0.12s ================

8 : Job ID 513a61a328fb4f12827c770cd92a32b9
test outcome: killed
app\operacoes_financeiras.py, start pos: (35, 29), end pos: (35, 30)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 1
--- mutation diff ---
--- aapp\operacoes_financeiras.py
+++ bapp\operacoes_financeiras.py
@@ -32,7 +32,7 @@
 def transferir(contas, client_id_origem, client_id_destino, valor):
     conta_origem = pegar_conta(contas, client_id_origem)
     conta_destino = pegar_conta(contas, client_id_destino)
-    if conta_origem["saldo"] < valor:
+    if conta_origem["saldo"] > valor:
         raise Exception("Saldo insuficiente")
     conta_origem["saldo"] -= valor
     conta_destino["saldo"] += valor
============================= test session starts =============================
tests\test_operacoes_financeiras.py ..F                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
================================== FAILURES ===================================
_________________________ TestContas.test_transferir __________________________
self = <test_operacoes_financeiras.TestContas testMethod=test_transferir>
    def test_transferir(self):
        with self.assertRaises(Exception):
>           transferir(self.contas, "client_id_123", "client_id_abc", 1100)
E           AssertionError: Exception not raised
tests\test_operacoes_financeiras.py:35: AssertionError
=========================== short test summary info ====================

9 : Job ID 83c9013e41544fa6ae25302a2224cc70
test outcome: killed
app\operacoes_financeiras.py, start pos: (24, 22), end pos: (24, 23)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 0
--- mutation diff ---
--- aapp\operacoes_financeiras.py
+++ bapp\operacoes_financeiras.py
@@ -21,7 +21,7 @@
 def sacar(contas, client_id, valor):
     conta = pegar_conta(contas, client_id)
-    if conta["saldo"] < valor:
+    if conta["saldo"] >= valor:
         raise Exception("Saldo insuficiente")
     conta["saldo"] -= valor
     registrar_historico(conta, {
============================= test session starts =============================
tests\test_operacoes_financeiras.py .F.                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
================================== FAILURES ===================================
____________________________ TestContas.test_sacar ____________________________
self = <test_operacoes_financeiras.TestContas testMethod=test_sacar>
    def test_sacar(self):
        with self.assertRaises(Exception):
>           sacar(self.contas, "client_id_123", 1100)
E           AssertionError: Exception not raised
tests\test_operacoes_financeiras.py:26: AssertionError
=========================== short test summary info ===========================
FAILED tests/test_operacoes_financeiras.py::TestContas::test_sacar - Assertio...
========================= 1 failed, 4 passed in 0.12s ==============

10 : Job ID cb90cf9c21ea4115a8e7c43f66e908a6
test outcome: killed
app\operacoes_financeiras.py, start pos: (35, 29), end pos: (35, 30)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 1
--- mutation diff ---
--- aapp\operacoes_financeiras.py
+++ bapp\operacoes_financeiras.py
@@ -32,7 +32,7 @@
 def transferir(contas, client_id_origem, client_id_destino, valor):
     conta_origem = pegar_conta(contas, client_id_origem)
     conta_destino = pegar_conta(contas, client_id_destino)
-    if conta_origem["saldo"] < valor:
+    if conta_origem["saldo"] >= valor:
         raise Exception("Saldo insuficiente")
     conta_origem["saldo"] -= valor
     conta_destino["saldo"] += valor
============================= test session starts =============================
tests\test_operacoes_financeiras.py ..F                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
================================== FAILURES ===================================
_________________________ TestContas.test_transferir __________________________
self = <test_operacoes_financeiras.TestContas testMethod=test_transferir>
    def test_transferir(self):
        with self.assertRaises(Exception):
>           transferir(self.contas, "client_id_123", "client_id_abc", 1100)
E           AssertionError: Exception not raised
tests\test_operacoes_financeiras.py:35: AssertionError
=========================== short test summary info =================

11 : Job ID 653aa45dd6294c71809c95752918c742
test outcome: killed
app\operacoes_financeiras.py, start pos: (24, 22), end pos: (24, 23)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 0
--- mutation diff ---
--- aapp\operacoes_financeiras.py
+++ bapp\operacoes_financeiras.py
@@ -21,7 +21,7 @@
 def sacar(contas, client_id, valor):
     conta = pegar_conta(contas, client_id)
-    if conta["saldo"] < valor:
+    if conta["saldo"] is valor:
         raise Exception("Saldo insuficiente")
     conta["saldo"] -= valor
     registrar_historico(conta, {
============================= test session starts =============================
tests\test_operacoes_financeiras.py .F.                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
================================== FAILURES ===================================
____________________________ TestContas.test_sacar ____________________________
self = <test_operacoes_financeiras.TestContas testMethod=test_sacar>
    def test_sacar(self):
        with self.assertRaises(Exception):
>           sacar(self.contas, "client_id_123", 1100)
E           AssertionError: Exception not raised
tests\test_operacoes_financeiras.py:26: AssertionError
=========================== short test summary info ===========================
FAILED tests/test_operacoes_financeiras.py::TestContas::test_sacar - Assertio...
========================= 1 failed, 4 passed in 0.12s ==============

12 : Job ID f6e19d978a334ba6b781bad31abb3ea7
test outcome: killed
app\operacoes_financeiras.py, start pos: (35, 29), end pos: (35, 30)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 1
--- mutation diff ---
--- aapp\operacoes_financeiras.py
+++ bapp\operacoes_financeiras.py
@@ -32,7 +32,7 @@
 def transferir(contas, client_id_origem, client_id_destino, valor):
     conta_origem = pegar_conta(contas, client_id_origem)
     conta_destino = pegar_conta(contas, client_id_destino)
-    if conta_origem["saldo"] < valor:
+    if conta_origem["saldo"] is valor:
         raise Exception("Saldo insuficiente")
     conta_origem["saldo"] -= valor
     conta_destino["saldo"] += valor
============================= test session starts =============================
tests\test_operacoes_financeiras.py ..F                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
================================== FAILURES ===================================
_________________________ TestContas.test_transferir __________________________
self = <test_operacoes_financeiras.TestContas testMethod=test_transferir>
    def test_transferir(self):
        with self.assertRaises(Exception):
>           transferir(self.contas, "client_id_123", "client_id_abc", 1100)
E           AssertionError: Exception not raised
tests\test_operacoes_financeiras.py:35: AssertionError
=========================== short test summary info ==================

13 : Job ID 436f4974c54e44ba9e54d68ea72f7be1
test outcome: killed
app\operacoes_financeiras.py, start pos: (24, 22), end pos: (24, 23)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 0
--- mutation diff ---
--- aapp\operacoes_financeiras.py
+++ bapp\operacoes_financeiras.py
@@ -21,7 +21,7 @@
 def sacar(contas, client_id, valor):
     conta = pegar_conta(contas, client_id)
-    if conta["saldo"] < valor:
+    if conta["saldo"] is not valor:
         raise Exception("Saldo insuficiente")
     conta["saldo"] -= valor
     registrar_historico(conta, {
============================= test session starts =============================
tests\test_operacoes_financeiras.py .F.                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
================================== FAILURES ===================================
____________________________ TestContas.test_sacar ____________________________
self = <test_operacoes_financeiras.TestContas testMethod=test_sacar>
    def test_sacar(self):
        with self.assertRaises(Exception):
            sacar(self.contas, "client_id_123", 1100)
>       sacar(self.contas, "client_id_123", 100)
tests\test_operacoes_financeiras.py:27: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
contas = {'client_id_123': {'historico': [], 'saldo': 1000}, 'client_id_abc': {'historico': [], 'saldo': 500}}
client_id = 'client_id_123', valor = 100

14 : Job ID 9326e4ad462a4d15b7cbe2505ac81a21
test outcome: killed
app\operacoes_financeiras.py, start pos: (35, 29), end pos: (35, 30)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 1
--- mutation diff ---
--- aapp\operacoes_financeiras.py
+++ bapp\operacoes_financeiras.py
@@ -32,7 +32,7 @@
 def transferir(contas, client_id_origem, client_id_destino, valor):
     conta_origem = pegar_conta(contas, client_id_origem)
     conta_destino = pegar_conta(contas, client_id_destino)
-    if conta_origem["saldo"] < valor:
+    if conta_origem["saldo"] is not valor:
         raise Exception("Saldo insuficiente")
     conta_origem["saldo"] -= valor
     conta_destino["saldo"] += valor
============================= test session starts =============================
tests\test_operacoes_financeiras.py ..F                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
================================== FAILURES ===================================
_________________________ TestContas.test_transferir __________________________
self = <test_operacoes_financeiras.TestContas testMethod=test_transferir>
    def test_transferir(self):
        with self.assertRaises(Exception):
            transferir(self.contas, "client_id_123", "client_id_abc", 1100)
>       transferir(self.contas, "client_id_123", "client_id_abc", 100)
tests\test_operacoes_financeiras.py:36: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

15 : Job ID c74336113d85422baa575c0f1436aa39
test outcome: killed
app\operacoes_financeiras.py, start pos: (24, 7), end pos: (24, 29)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- aapp\operacoes_financeiras.py
+++ bapp\operacoes_financeiras.py
@@ -21,7 +21,7 @@
 def sacar(contas, client_id, valor):
     conta = pegar_conta(contas, client_id)
-    if conta["saldo"] < valor:
+    if not conta["saldo"] < valor:
         raise Exception("Saldo insuficiente")
     conta["saldo"] -= valor
     registrar_historico(conta, {
============================= test session starts =============================
tests\test_operacoes_financeiras.py .F.                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
================================== FAILURES ===================================
____________________________ TestContas.test_sacar ____________________________
self = <test_operacoes_financeiras.TestContas testMethod=test_sacar>
    def test_sacar(self):
        with self.assertRaises(Exception):
>           sacar(self.contas, "client_id_123", 1100)
E           AssertionError: Exception not raised
tests\test_operacoes_financeiras.py:26: AssertionError
=========================== short test summary info ===========================
FAILED tests/test_operacoes_financeiras.py::TestContas::test_sacar - Assertio...
========================= 1 failed, 4 passed in 0.12s =========================

16 : Job ID 7e6cf8dbf4c54204b6f11c649ab38dfa
test outcome: killed
app\operacoes_financeiras.py, start pos: (35, 7), end pos: (35, 36)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- aapp\operacoes_financeiras.py
+++ bapp\operacoes_financeiras.py
@@ -32,7 +32,7 @@
 def transferir(contas, client_id_origem, client_id_destino, valor):
     conta_origem = pegar_conta(contas, client_id_origem)
     conta_destino = pegar_conta(contas, client_id_destino)
-    if conta_origem["saldo"] < valor:
+    if not conta_origem["saldo"] < valor:
         raise Exception("Saldo insuficiente")
     conta_origem["saldo"] -= valor
     conta_destino["saldo"] += valor
============================= test session starts =============================
tests\test_operacoes_financeiras.py ..F                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
================================== FAILURES ===================================
_________________________ TestContas.test_transferir __________________________
self = <test_operacoes_financeiras.TestContas testMethod=test_transferir>
    def test_transferir(self):
        with self.assertRaises(Exception):
>           transferir(self.contas, "client_id_123", "client_id_abc", 1100)
E           AssertionError: Exception not raised
tests\test_operacoes_financeiras.py:35: AssertionError
=========================== short test summary info ===========================
FAILED tests

17 : Job ID 9dcfd51796e94bceb41b672d6bfd5ca6
test outcome: killed
app\utils.py, start pos: (14, 13), end pos: (14, 15)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 0
--- mutation diff ---
--- aapp\utils.py
+++ bapp\utils.py
@@ -11,7 +11,7 @@
 def pegar_conta(contas, client_id):
     conta = contas.get(client_id)
-    if conta is None:
+    if conta is not None:
         raise Exception("Conta inexistente")
     return conta
============================= test session starts =============================
tests\test_operacoes_financeiras.py FFF                                  [ 60%]
tests\test_utils.py F.                                                   [100%]
================================== FAILURES ===================================
__________________________ TestContas.test_depositar __________________________
self = <test_operacoes_financeiras.TestContas testMethod=test_depositar>
    def test_depositar(self):
>       depositar(self.contas, "client_id_123", 100)
tests\test_operacoes_financeiras.py:18: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
app\operacoes_financeiras.py:15: in depositar
    conta = pegar_conta(contas, client_id)
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
contas = {'client_id_123': {'historico': [], 'saldo': 1000}, 'client_id_abc': {'historico': [], 'saldo': 500}}
client_id = 'client_id_123'
    def pegar_conta(contas, client_id):
        conta

18 : Job ID e55ae697690247de8e0b812697924dce
test outcome: killed
app\utils.py, start pos: (14, 7), end pos: (14, 20)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- aapp\utils.py
+++ bapp\utils.py
@@ -11,7 +11,7 @@
 def pegar_conta(contas, client_id):
     conta = contas.get(client_id)
-    if conta is None:
+    if not conta is None:
         raise Exception("Conta inexistente")
     return conta
============================= test session starts =============================
tests\test_operacoes_financeiras.py FFF                                  [ 60%]
tests\test_utils.py F.                                                   [100%]
================================== FAILURES ===================================
__________________________ TestContas.test_depositar __________________________
self = <test_operacoes_financeiras.TestContas testMethod=test_depositar>
    def test_depositar(self):
>       depositar(self.contas, "client_id_123", 100)
tests\test_operacoes_financeiras.py:18: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
app\operacoes_financeiras.py:15: in depositar
    conta = pegar_conta(contas, client_id)
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
contas = {'client_id_123': {'historico': [], 'saldo': 1000}, 'client_id_abc': {'historico': [], 'saldo': 500}}
client_id = 'client_id_123'
    def pegar_conta(contas, client_id):
        conta = contas.get(client_id)

19 : Job ID 1a46c62d53bf443e8cd8bba05fa1a00b
SURVIVED
test outcome: survived
app\foo.py, start pos: (4, 13), end pos: (4, 14)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 0
--- mutation diff ---
--- aapp\foo.py
+++ bapp\foo.py
@@ -1,4 +1,4 @@
 def foo():
     x = 1
     y = 2
-    return x + y
+    return x - y
============================= test session starts =============================
tests\test_operacoes_financeiras.py ...                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
============================== 5 passed in 0.04s ==============================

20 : Job ID 93557734a9394280bb4c4bd473d23f2d
SURVIVED
test outcome: survived
app\foo.py, start pos: (4, 13), end pos: (4, 14)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 0
--- mutation diff ---
--- aapp\foo.py
+++ bapp\foo.py
@@ -1,4 +1,4 @@
 def foo():
     x = 1
     y = 2
-    return x + y
+    return x * y
============================= test session starts =============================
tests\test_operacoes_financeiras.py ...                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
============================== 5 passed in 0.04s ==============================

21 : Job ID 4ee508c198dd4cffb11168b18cf696cb
SURVIVED
test outcome: survived
app\foo.py, start pos: (4, 13), end pos: (4, 14)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 0
--- mutation diff ---
--- aapp\foo.py
+++ bapp\foo.py
@@ -1,4 +1,4 @@
 def foo():
     x = 1
     y = 2
-    return x + y
+    return x / y
============================= test session starts =============================
tests\test_operacoes_financeiras.py ...                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
============================== 5 passed in 0.04s ==============================

22 : Job ID 9aa801c12e9a45a6809b4e6c3caaf0ab
SURVIVED
test outcome: survived
app\foo.py, start pos: (4, 13), end pos: (4, 14)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 0
--- mutation diff ---
--- aapp\foo.py
+++ bapp\foo.py
@@ -1,4 +1,4 @@
 def foo():
     x = 1
     y = 2
-    return x + y
+    return x // y
============================= test session starts =============================
tests\test_operacoes_financeiras.py ...                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
============================== 5 passed in 0.04s ==============================

23 : Job ID c86f49a739f042e3b43e126d5ab19b3a
SURVIVED
test outcome: survived
app\foo.py, start pos: (4, 13), end pos: (4, 14)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 0
--- mutation diff ---
--- aapp\foo.py
+++ bapp\foo.py
@@ -1,4 +1,4 @@
 def foo():
     x = 1
     y = 2
-    return x + y
+    return x % y
============================= test session starts =============================
tests\test_operacoes_financeiras.py ...                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
============================== 5 passed in 0.04s ==============================

24 : Job ID 34ccc44cac6a4df49e98bb5588690072
SURVIVED
test outcome: survived
app\foo.py, start pos: (4, 13), end pos: (4, 14)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 0
--- mutation diff ---
--- aapp\foo.py
+++ bapp\foo.py
@@ -1,4 +1,4 @@
 def foo():
     x = 1
     y = 2
-    return x + y
+    return x ** y
============================= test session starts =============================
tests\test_operacoes_financeiras.py ...                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
============================== 5 passed in 0.04s ==============================
