25 : Job ID 4d2dfe8f91ac42cbbfeef61b93d6406d
SURVIVED
test outcome: survived
app\foo.py, start pos: (4, 13), end pos: (4, 14)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 0
--- mutation diff ---
--- aapp\foo.py
+++ bapp\foo.py
@@ -1,4 +1,4 @@
 def foo():
     x = 1
     y = 2
-    return x + y
+    return x >> y
============================= test session starts =============================
tests\test_operacoes_financeiras.py ...                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
============================== 5 passed in 0.04s ==============================

26 : Job ID a2fd768e220941fea5fb6c41a5e68594
SURVIVED
test outcome: survived
app\foo.py, start pos: (4, 13), end pos: (4, 14)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 0
--- mutation diff ---
--- aapp\foo.py
+++ bapp\foo.py
@@ -1,4 +1,4 @@
 def foo():
     x = 1
     y = 2
-    return x + y
+    return x << y
============================= test session starts =============================
tests\test_operacoes_financeiras.py ...                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
============================== 5 passed in 0.05s ==============================

27 : Job ID 5aa0e16a290f4fa6a23325590950d646
SURVIVED
test outcome: survived
app\foo.py, start pos: (4, 13), end pos: (4, 14)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 0
--- mutation diff ---
--- aapp\foo.py
+++ bapp\foo.py
@@ -1,4 +1,4 @@
 def foo():
     x = 1
     y = 2
-    return x + y
+    return x | y
============================= test session starts =============================
tests\test_operacoes_financeiras.py ...                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
============================== 5 passed in 0.04s ==============================

28 : Job ID b9ebcca25c1242258f86a0a0a29dee44
SURVIVED
test outcome: survived
app\foo.py, start pos: (4, 13), end pos: (4, 14)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 0
--- mutation diff ---
--- aapp\foo.py
+++ bapp\foo.py
@@ -1,4 +1,4 @@
 def foo():
     x = 1
     y = 2
-    return x + y
+    return x & y
============================= test session starts =============================
tests\test_operacoes_financeiras.py ...                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
============================== 5 passed in 0.04s ==============================

29 : Job ID e66c8d2adde545088aa2cdbf18c01641
SURVIVED
test outcome: survived
app\foo.py, start pos: (4, 13), end pos: (4, 14)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 0
--- mutation diff ---
--- aapp\foo.py
+++ bapp\foo.py
@@ -1,4 +1,4 @@
 def foo():
     x = 1
     y = 2
-    return x + y
+    return x ^ y
============================= test session starts =============================
tests\test_operacoes_financeiras.py ...                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
============================== 5 passed in 0.04s ==============================

30 : Job ID 8f6d90a037d04b3288c624696fad86bf
SURVIVED
test outcome: survived
app\foo.py, start pos: (2, 8), end pos: (2, 9)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- aapp\foo.py
+++ bapp\foo.py
@@ -1,4 +1,4 @@
 def foo():
-    x = 1
+    x = 2
     y = 2
     return x + y
============================= test session starts =============================
tests\test_operacoes_financeiras.py ...                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
============================== 5 passed in 0.04s ==============================

31 : Job ID 149ddf4c854246cdbc4a2345d35e7a7a
SURVIVED
test outcome: survived
app\foo.py, start pos: (2, 8), end pos: (2, 9)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- aapp\foo.py
+++ bapp\foo.py
@@ -1,4 +1,4 @@
 def foo():
-    x = 1
+    x = 0
     y = 2
     return x + y
============================= test session starts =============================
tests\test_operacoes_financeiras.py ...                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
============================== 5 passed in 0.04s ==============================

32 : Job ID 071c1f406a584305a2bb3c4652a25aee
SURVIVED
test outcome: survived
app\foo.py, start pos: (3, 8), end pos: (3, 9)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- aapp\foo.py
+++ bapp\foo.py
@@ -1,4 +1,4 @@
 def foo():
     x = 1
-    y = 2
+    y = 3
     return x + y
============================= test session starts =============================
tests\test_operacoes_financeiras.py ...                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
============================== 5 passed in 0.05s ==============================

33 : Job ID 739479c983684f109c6b490c6cf8df1d
SURVIVED
test outcome: survived
app\foo.py, start pos: (3, 8), end pos: (3, 9)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- aapp\foo.py
+++ bapp\foo.py
@@ -1,4 +1,4 @@
 def foo():
     x = 1
-    y = 2
+    y = 1
     return x + y
============================= test session starts =============================
tests\test_operacoes_financeiras.py ...                                  [ 60%]
tests\test_utils.py ..                                                   [100%]
============================== 5 passed in 0.04s ==============================
